const dataanime = [
    {
        name:'АНІМЭ'
    },
{
    src:'./src/images/anime-family.jpeg',
    title:'Сям\'я шпіёна',
    description:'Астанія і Весталіс на працягу доўгага часу былі ў стане халоднай вайны. Усходні аддзел Весталіскай службы разведкі даручае Змроку, свайму самаму таленавітаму шпіёну, абсалютна сакрэтную місію: прасачыць за Донаванам Дэзмандам, галавой адной з палітычных партый Астаніі.',
    link:'https://anibel.net/anime/spy-x-family'
},
{
    src:'./src/images/anime-comi.jpeg',
    title:'Комі цяжка мець зносіны',
    description:'У першы ж дзень вучобы ў школе Ітан дзяўчына па імені Сёко Комі ў вачах іншых вучняў становіцца каралевай школы. Прычына ў небачанай прыгажосці дзяўчыны: цудоўныя цёмныя валасы, вышыня, зграбнасць. Валодаючы ўсім гэтым Комі без праблем звяртае на сябе ўвагу кожнага сустрэчнага.',
    link:'https://anibel.net/anime/komi-san-wa-komyushou-desu.'
},
    {
        src:'./src/images/anime-kvetka.jpg',
        title:'Кветка Лан Мо',
        description:'Лан Мо — звычайная, нічым не цікавая пятнаццацігадовая дзяўчына, якая любіць фаст-фуд і мае хлапечыя нахілы. Яна закаханая ў свайго найлепшага сябра, Лі Юфэнга, аднак не можа раскрыць яму свае пачуцці',
        link:'https://anibel.net/anime/lan-mo-de-hua'
    },
    {
        src:'./src/images/anime-schytak.jpeg',
        title:'Сшытак смерці',
        description:'Сшытак смерці — звышнатуральны артэфакт, з дапамогай якога можна забіваць. Уладальнік аднаго з такіх сшыткаў, бог смерці Р’юк, пакутуе праз смяротную нуду і шукае спосабу пацешыцца.',
        link:'https://anibel.net/anime/death-note'
    },
    {
        src: './src/images/anime-ulada.jpeg',
        title: 'Улада кніжнага чарвяка 3\n',
        description: 'Трэці сезона анімэ «Улада кніжнага чарвяка».',
        link: 'https://anibel.net/anime/honzuki-no-gekokujou:-shisho-ni-naru-tame-ni-wa-shudan-wo-erandeiraremasen-3'
    },
     {
         src:'./src/images/anime-neverland.jpg',
         title:'Абяцаны Нэвэрлэнд 2',
         description:'Эме, Рэю і іншым дзецям шчасліва ўдаецца пакінуць тэрыторыю прытулку «Жыватворны Дом». Але перабрацца за сцяну, якая аддзяляе Дом ад знешняга свету, яшчэ не значыць быць у бяспецы, бо зараз яны ў вышуку. ',
         link:'https://anibel.net/anime/yakusoku-no-neverland-2'
     },
     {
         src:'./src/images/anime-afrosamuray.jpg',
         title:'Афрасамурай: Уваскрашэнне',
         description:'Атрымаўшы павязку нумара адзін, Афра вырашае не надзяваць яе, каб паспрабаваць жыць спакойным жыццём, без бітваў і пастаяннай небяспекі.',
         link:'https://anibel.net/anime/afro-samurai:-resurrection'
     },
     {
         src:'./src/images/anime-witch.jpg',
         title:'Спаліць гэтую ведзьму',
         description:'Першае правіла Адваротнага Лондана – звычайным людзям ні пры якіх абставінах нельга чапаць цмокаў. Больш правілаў няма. ',
         link:'https://anibel.net/anime/burn-the-witch'
    },
    {
        src:'./src/images/anime-children.jpg',
        title:'Дзіця надвор\'я',
        description:'У пошуках вольнага жыцця шаснаццацігадовы Ходака ўцякае з бацькоўскай хаты ў Токіа. Дождж ліе некалькі тыдняў запар, працу збегламу школьніку знайсці складана, апошнія грошы на зыходзе. Можа, выпадкова сустрэтая дзяўчына стане для яго тым самым сонечным промнем?',
        link:'https://anibel.net/anime/tenki-no-ko'
    },
    {
        src:'./src/images/anime-5.jpg',
        title:'5 сантыметраў у секунду',
        description:'Такакі і Акары разам навучаліся ў пачатковай школе. Яны часта сустракалі адно аднаго ў бібліятэцы, таму хутка пасябравалі. Паступова іх сяброўства ператварылася ў каханне. Яны абое марылі пайсці ў адну сярэднюю школу. ',
        link:'https://anibel.net/anime/byousoku-5-centimeter'
    },
    {
        src:'./src/images/anime-zver.jpg',
        title:'Звер новага класа',
        description:'У гэтай гісторыі побач з чалавецтвам жывуць звералюдзі. Сучасны свет, дзе прырода ўступае цывілізацыі, а людзей з генамі звяроў выганяюць з родных мясцін.',
        link:'https://anibel.net/anime/brand-new-animal'
    },
    {
        src:'./src/images/vezha.jpg',
        title:'Вежа Бога',
        description:'У свеце з\'явілася таямнічая сіла, вядомая як Шынсу. А ёсць яшчэ Вежа — дом для людзей, якія карыстаюцца перавагамі Шынсу і называюць сябе «абранымі».',
        link:'https://anibel.net/anime/kami-no-tou'
    }
]

const datafilms = [
    {
        name:'ФІЛЬМЫ'
    },
    {
        src:'./src/images/film-gambit.png',
        title:'Гамбіт каралевы',
        description:'Падзеі серыяла адбываюцца ў пяцідзясятых гадах мінулага стагоддзя. Элізабет Харман — дзяўчына, якую выхоўвалі ў дзіцячым доме.',
        link:'https://anibel.net/cinema/the-queen\'s-gambit'
    },
    {
        src:'./src/images/film-vangog.png',
        title:'Ван Гог: На парозе вечнасці',
        description:'Вінцэнт Ван Гог быў апанаваны жывапісам і марыў змяніць свет. Ён жыў у Парыжы і сябраваў з Полем Гагенам, які параіў мастаку шукаць яркае і цёплае святло на поўдні Францыі. ',
        link:'https://anibel.net/cinema/at-eternity\'s-gate'
    },
    {
        src:'./src/images/film-goodnews.png',
        title:'Добрыя прадвесці',
        description: 'У цэнтры сюжэта — анёл Азірафаэль і дэман Кроўлі, якія аб\'ядноўваюць сілы, каб папярэдзіць канец свету, таму што за доўгія стагоддзі яны паспелі звыкнуцца з жыццём на Зямлі.',
        link:'https://anibel.net/cinema/good-omens'
    },
    {
        src:'./src/images/film-malif.jpg',
        title:'Малефісэнта',
        description:'Юная чараўніца Малефісэнта вяла адасобленае жыццё ў зачараваным лесе, акружаная казачнымі істотамі, але аднойчы ўсё змянілася... У яе свет уварваліся людзі, якія прынеслі з сабой разбурэнне і хаос',
        link:'https://anibel.net/cinema/maleficent'
    },
    {
        src: './src/images/film-three.jpeg',
        title: 'Тры арэшкі для Папялушкі',
        description: 'Мачыха Папялушкі ўсімі сіламі хоча выдаць сваю дурную і злую родную дачку замуж за прынца. Але таму зусім не жадаецца жаніцца, ён сварыцца з бацькам і збіраецца пакінуць палац, але... ',
        link: 'https://anibel.net/cinema/tri-orisky-pro-popelku'
    },
    {
        src:'./src/images/film-rik.png',
        title:'Рык і Морці',
        description:'Рык — звар\'яцелы навуковец, які ўцягвае сваёго ўнука Морці ў навукова-фантастычныя прыгоды, вынікі якіх нярэдка садзейнічаюць разбурэнню іх сям\'і, а часам і цэлага свету. ',
        link:'https://anibel.net/cinema/rick-and-morty'
    },
    {
        src:'./src/images/film-praz.png',
        title:'Праз паўстагоддзя паэзіі',
        description:'Праз чвэрць стагоддзя пасля пагрому ў Рывіі здзяйсняецца напад на Каэр Морхен, стары аплот ведзьмароў Школы Ваўка. Узначальвае атаку магутны воін Агай. ',
        link:'https://anibel.net/cinema/pol-wieku-poezji-pozniej'
    },
    {
        src:'./src/images/film-legenda.png',
        title:'Легенды «Смяротнай бітвы»',
        description:'Чарнакніжнік Шан Цунг наладжвае міжпрасторавы турнір баявых мастацтваў, дзе пераможца мусіць пабіцца з самім чараўніком за лёс роднага свету. У турніры вырашае ўдзельнічаць Скарпіён, што прагне помсты за смерць сям\'і і клана.',
        link:'https://anibel.net/cinema/mortal-kombat-legends:-scorpion\'s-revenge'
    },
    {
        src:'./src/images/film-squid.jpg',
        title:'Гульня ў кальмара',
        description:'Сон Гі Хун ужо немалады, па вушы заграз у даўгах і сядзіць на шыі ў матулі. Нават выйграныя на скачках грошы ў яго руках доўга не затрымліваюцца, і аднойчы ён сустракае ў метро незнаёмца, які спачатку прапануе згуляць у дзіцячую, а потым уручае Гі Хуну нямалую суму і візітку.',
        link:'https://anibel.net/cinema/squid-game'
    },
    {
        src:'./src/images/film-viadzmiar.png',
        title:'Вядзьмар: Кашмар воўка',
        description:'Весямір вырваўся з галечы і стаў ведзьмаром. Цяпер ён забівае пачвар за грошы і славу. Але прыходзіць новы вораг, і Весяміру давядзецца сутыкнуцца з дэманамі свайго мінулага.',
        link:'https://anibel.net/cinema/the-witcher:-nightmare-of-the-wolf'
    },
    {
        src:'./src/images/klich.jpeg',
        title:'Кліч Пекла',
        description:'2023 год. Па ўсім свеце адбываецца загадкавы феномен — некаторыя людзі атрымліваюць прадказанні аб сваёй смерці, і акурат у прызначаны час за імі прыходзяць злобныя істоты і забіваюць.',
        link:'https://anibel.net/cinema/hellbound'
    },
    {
        src:'./src/images/film-susvet.jpg',
        title:'Сусветная змова',
        description:'Ценевы ўрад кантралюе ў Амерыцы ўсё, пачынаючы ад загадаў прэзідэнта, і заканчваючы надвор\'ем у краіне. Дапамагае яму ў гэтым арганізацыя Cognito Inc, у якой працуе галоўная гераіня — геніяльная вынаходніца Рэйган.',
        link:'https://anibel.net/cinema/inside-job'
    }
]

const datayoutube = [
    {
        name:'ЮТУБ'
    },
    {
        src:'./src/images/yt-hodna.jpg',
        title:'Годна',
        description:'Грамадская кампанія «Годна» прысвечана стварэнню і прасоўванню сучаснай нацыянальнай ідэі Беларусі. Мы імкнемся ўмацоўваць беларускую ідэнтычнасць на глебе агульных і стваральных каштоўнасцяў.\n',
        link:'https://www.youtube.com/c/hodnaby/featured'
    },
    {
        src:'./src/images/yt-moda.jpg',
        title:'Мода на мову',
        description:'Вітаю ўсіх на канале "Мода На Мову" які быў створаны каб падняць папулярнасць беларускай мовы і пачаць выкарыстоўваць яе ў паўсядзённым жыцці.',
        link:'https://www.youtube.com/channel/UCSozv0d23TKZxN3r1yJINeQ/featured'
    },
    {
        src:'./src/images/yt-karani.jpg',
        title:'Карані і вытокі',
        description: 'Гісторыя Беларусі. Наша мова. Абрады і традыцыі.',
        link:'https://www.youtube.com/channel/UC5hc3uwPuFLy-Z4AdztnHaQ'
    },
    {
        src:'./src/images/yt-wir.jpg',
        title:'WIR BY',
        description:'Беларуская і сусветная культура і гісторыя. Распавядаем пра мастацтва, жывапіс, літаратуру, гісторыю, лінгвістыку, кіно, музыку і міфалогію па-беларуску ў лёгкай форме разам з прафесійнымі даследчыкамі і выкладчыкамі.',
        link:'https://www.youtube.com/c/WirBy/featured'
    },
    {
        src: './src/images/yt-baybus.jpg',
        title: 'BAYBUS',
        description: 'Забаўляльны, навучальны, развіццёвы канал БЭЙБУС.Лепшы сябар маленькіх гарэз і дарослых жэўжыкаў. Канал з клопатам і павагай, з хітрыкамі ды цікавосткамі, з пяшчотай і весялосцю.Будзем разам усміхацца, адкрываць новае, здзіўляцца неверагоднаму.',
        link: 'https://www.youtube.com/c/baybusby/featured'
    },
    {
        src:'./src/images/yt-tut.jpg',
        title:'Тутэйшы Шляхціч',
        description:'Канал накіраваны на папулярызацыю беларускай культуры, гісторыі і мовы. На гэтым канале вы зможаце пабачыць ролікі аб гістарычных падзеях, асобах, гісторыка-культурных каштоўнасцях, цікавых месцах і аб\'ектах звязаных з Беларуссю, а таксама ўсялякія падарожжы, ды забаўкі.',
        link:'https://www.youtube.com/c/%D0%A2%D1%83%D1%82%D1%8D%D0%B9%D1%88%D1%8B%D0%A8%D0%BB%D1%8F%D1%85%D1%86%D1%96%D1%87/featured'
    },
    {
        src:'./src/images/yt-sluchaj.jpg',
        title:'Слухай Сюды',
        description:'Тут вы знойдзеце агляды актуальных падзей Беларусі і замежжа. Меркаваньні экспертаў і аналітыку па важных культурных, палітычных і эканамічных сусветных трэндах. Цікавыя факты і агляды гістарычных падзей. А таксама пераклады замежных экспертаў з Prager University',
        link:'https://www.youtube.com/channel/UCWerimu-lIkwyUGeeB2CDpA/featured'
    },
    {
        src:'./src/images/yt-movananov.jpg',
        title:'movananova belarusvideo',
        description:'Відэа ад моўных курсаў «Мова Нанова»',
        link:'https://www.youtube.com/channel/UCSVx7NyLPrRWHLjzjWdAd5A/featured'
    },
    {
        src:'./src/images/yt-vital.jpg',
        title:'Віталь Чырвінскі',
        description:'Развіццё ваеннай справы на беларускіх землях. Структура войска. Сродкі ўзброенай барацьбы. Фартыфікацыя. Ваенная стратэгія. Тактыка. Войны, паходы, бітвы. Палкаводцы і военачальнікі зямлі беларускай. Полацкае княства. Вялікае Княства Літоўскае.',
        link:'https://www.youtube.com/c/%D0%92%D1%96%D1%82%D0%B0%D0%BB%D1%8C%D0%A7%D1%8B%D1%80%D0%B2%D1%96%D0%BD%D1%81%D0%BA%D1%96%D0%A0%D0%90%D0%97%D0%9C%D0%9E%D0%92%D0%AB%D0%90%D0%91%D0%93%D0%86%D0%A1%D0%A2%D0%9E%D0%A0%D0%AB%D0%86%D0%91%D0%95%D0%9B%D0%90%D0%A0%D0%A3%D0%A1%D0%86/featured'
    },
    {
        src:'./src/images/yt-maj.jpg',
        title:'Маёнтак Падароск',
        description:'Старажытны шляхецкі маёнтак, які мае набыць новае жыццё як музэй беларускай шляхты і турыстычна-рэкрэацыйны цэнтр.',
        link:'https://www.youtube.com/channel/UCy_bzshvfnTZk5J-hyXRLPw/featured'
    },
    {
        src:'./src/images/yt-chadan.jpg',
        title:'ХАДАНОВІЧ ',
        description:'Вітаю вас на сваім канале! З вамі Андрэй Хадановіч ― беларускі паэт, перакладчык, літаратуразнаўца і выкладчык. Тут я распавядаю пра літаратуру, якая стала актуальнай у нашы часы, пра літаратуру, у якой мы з вамі цяпер жывём.',
        link:'https://www.youtube.com/channel/UCUJQcp9gg3sc46kBsppBl6Q'
    },
    {
        src:'./src/images/yt-hrodna.jpg',
        title:'Сусветная змова',
        description:'Месца з гісторыяй',
        link:'https://www.youtube.com/channel/UCQgR5LInXzatrSebZW5k6xw'
    }
]

const databooks = [
    {
        name:'КНІГІ'
    },
    {
        src:'./src/images/yt-hodna.jpg',
        title:'Годна',
        description:'Грамадская кампанія «Годна» прысвечана стварэнню і прасоўванню сучаснай нацыянальнай ідэі Беларусі. Мы імкнемся ўмацоўваць беларускую ідэнтычнасць на глебе агульных і стваральных каштоўнасцяў.\n',
        link:'https://www.youtube.com/c/hodnaby/featured'
    },
    {
        src:'./src/images/yt-moda.jpg',
        title:'Мода на мову',
        description:'Вітаю ўсіх на канале "Мода На Мову" які быў створаны каб падняць папулярнасць беларускай мовы і пачаць выкарыстоўваць яе ў паўсядзённым жыцці.',
        link:'https://www.youtube.com/channel/UCSozv0d23TKZxN3r1yJINeQ/featured'
    },
    {
        src:'./src/images/yt-karani.jpg',
        title:'Карані і вытокі',
        description: 'Гісторыя Беларусі. Наша мова. Абрады і традыцыі.',
        link:'https://www.youtube.com/channel/UC5hc3uwPuFLy-Z4AdztnHaQ'
    },
    {
        src:'./src/images/yt-wir.jpg',
        title:'WIR BY',
        description:'Беларуская і сусветная культура і гісторыя. Распавядаем пра мастацтва, жывапіс, літаратуру, гісторыю, лінгвістыку, кіно, музыку і міфалогію па-беларуску ў лёгкай форме разам з прафесійнымі даследчыкамі і выкладчыкамі.',
        link:'https://www.youtube.com/c/WirBy/featured'
    },
    {
        src: './src/images/yt-baybus.jpg',
        title: 'BAYBUS',
        description: 'Забаўляльны, навучальны, развіццёвы канал БЭЙБУС.Лепшы сябар маленькіх гарэз і дарослых жэўжыкаў. Канал з клопатам і павагай, з хітрыкамі ды цікавосткамі, з пяшчотай і весялосцю.Будзем разам усміхацца, адкрываць новае, здзіўляцца неверагоднаму.',
        link: 'https://www.youtube.com/c/baybusby/featured'
    },
    {
        src:'./src/images/yt-tut.jpg',
        title:'Тутэйшы Шляхціч',
        description:'Канал накіраваны на папулярызацыю беларускай культуры, гісторыі і мовы. На гэтым канале вы зможаце пабачыць ролікі аб гістарычных падзеях, асобах, гісторыка-культурных каштоўнасцях, цікавых месцах і аб\'ектах звязаных з Беларуссю, а таксама ўсялякія падарожжы, ды забаўкі.',
        link:'https://www.youtube.com/c/%D0%A2%D1%83%D1%82%D1%8D%D0%B9%D1%88%D1%8B%D0%A8%D0%BB%D1%8F%D1%85%D1%86%D1%96%D1%87/featured'
    },
    {
        src:'./src/images/yt-sluchaj.jpg',
        title:'Слухай Сюды',
        description:'Тут вы знойдзеце агляды актуальных падзей Беларусі і замежжа. Меркаваньні экспертаў і аналітыку па важных культурных, палітычных і эканамічных сусветных трэндах. Цікавыя факты і агляды гістарычных падзей. А таксама пераклады замежных экспертаў з Prager University',
        link:'https://www.youtube.com/channel/UCWerimu-lIkwyUGeeB2CDpA/featured'
    },
    {
        src:'./src/images/yt-movananov.jpg',
        title:'movananova belarusvideo',
        description:'Відэа ад моўных курсаў «Мова Нанова»',
        link:'https://www.youtube.com/channel/UCSVx7NyLPrRWHLjzjWdAd5A/featured'
    },
    {
        src:'./src/images/yt-vital.jpg',
        title:'Віталь Чырвінскі',
        description:'Развіццё ваеннай справы на беларускіх землях. Структура войска. Сродкі ўзброенай барацьбы. Фартыфікацыя. Ваенная стратэгія. Тактыка. Войны, паходы, бітвы. Палкаводцы і военачальнікі зямлі беларускай. Полацкае княства. Вялікае Княства Літоўскае.',
        link:'https://www.youtube.com/c/%D0%92%D1%96%D1%82%D0%B0%D0%BB%D1%8C%D0%A7%D1%8B%D1%80%D0%B2%D1%96%D0%BD%D1%81%D0%BA%D1%96%D0%A0%D0%90%D0%97%D0%9C%D0%9E%D0%92%D0%AB%D0%90%D0%91%D0%93%D0%86%D0%A1%D0%A2%D0%9E%D0%A0%D0%AB%D0%86%D0%91%D0%95%D0%9B%D0%90%D0%A0%D0%A3%D0%A1%D0%86/featured'
    },
    {
        src:'./src/images/yt-maj.jpg',
        title:'Маёнтак Падароск',
        description:'Старажытны шляхецкі маёнтак, які мае набыць новае жыццё як музэй беларускай шляхты і турыстычна-рэкрэацыйны цэнтр.',
        link:'https://www.youtube.com/channel/UCy_bzshvfnTZk5J-hyXRLPw/featured'
    },
    {
        src:'./src/images/yt-chadan.jpg',
        title:'ХАДАНОВІЧ ',
        description:'Вітаю вас на сваім канале! З вамі Андрэй Хадановіч ― беларускі паэт, перакладчык, літаратуразнаўца і выкладчык. Тут я распавядаю пра літаратуру, якая стала актуальнай у нашы часы, пра літаратуру, у якой мы з вамі цяпер жывём.',
        link:'https://www.youtube.com/channel/UCUJQcp9gg3sc46kBsppBl6Q'
    },
    {
        src:'./src/images/yt-hrodna.jpg',
        title:'Сусветная змова',
        description:'Месца з гісторыяй',
        link:'https://www.youtube.com/channel/UCQgR5LInXzatrSebZW5k6xw'
    }
]

const datasites = [
    {
        name:'САЙТЫ'
    },
    {
        src:'./src/images/yt-hodna.jpg',
        title:'Годна',
        description:'Грамадская кампанія «Годна» прысвечана стварэнню і прасоўванню сучаснай нацыянальнай ідэі Беларусі. Мы імкнемся ўмацоўваць беларускую ідэнтычнасць на глебе агульных і стваральных каштоўнасцяў.\n',
        link:'https://www.youtube.com/c/hodnaby/featured'
    },
    {
        src:'./src/images/yt-moda.jpg',
        title:'Мода на мову',
        description:'Вітаю ўсіх на канале "Мода На Мову" які быў створаны каб падняць папулярнасць беларускай мовы і пачаць выкарыстоўваць яе ў паўсядзённым жыцці.',
        link:'https://www.youtube.com/channel/UCSozv0d23TKZxN3r1yJINeQ/featured'
    },
    {
        src:'./src/images/yt-karani.jpg',
        title:'Карані і вытокі',
        description: 'Гісторыя Беларусі. Наша мова. Абрады і традыцыі.',
        link:'https://www.youtube.com/channel/UC5hc3uwPuFLy-Z4AdztnHaQ'
    },
    {
        src:'./src/images/yt-wir.jpg',
        title:'WIR BY',
        description:'Беларуская і сусветная культура і гісторыя. Распавядаем пра мастацтва, жывапіс, літаратуру, гісторыю, лінгвістыку, кіно, музыку і міфалогію па-беларуску ў лёгкай форме разам з прафесійнымі даследчыкамі і выкладчыкамі.',
        link:'https://www.youtube.com/c/WirBy/featured'
    },
    {
        src: './src/images/yt-baybus.jpg',
        title: 'BAYBUS',
        description: 'Забаўляльны, навучальны, развіццёвы канал БЭЙБУС.Лепшы сябар маленькіх гарэз і дарослых жэўжыкаў. Канал з клопатам і павагай, з хітрыкамі ды цікавосткамі, з пяшчотай і весялосцю.Будзем разам усміхацца, адкрываць новае, здзіўляцца неверагоднаму.',
        link: 'https://www.youtube.com/c/baybusby/featured'
    },
    {
        src:'./src/images/yt-tut.jpg',
        title:'Тутэйшы Шляхціч',
        description:'Канал накіраваны на папулярызацыю беларускай культуры, гісторыі і мовы. На гэтым канале вы зможаце пабачыць ролікі аб гістарычных падзеях, асобах, гісторыка-культурных каштоўнасцях, цікавых месцах і аб\'ектах звязаных з Беларуссю, а таксама ўсялякія падарожжы, ды забаўкі.',
        link:'https://www.youtube.com/c/%D0%A2%D1%83%D1%82%D1%8D%D0%B9%D1%88%D1%8B%D0%A8%D0%BB%D1%8F%D1%85%D1%86%D1%96%D1%87/featured'
    },
    {
        src:'./src/images/yt-sluchaj.jpg',
        title:'Слухай Сюды',
        description:'Тут вы знойдзеце агляды актуальных падзей Беларусі і замежжа. Меркаваньні экспертаў і аналітыку па важных культурных, палітычных і эканамічных сусветных трэндах. Цікавыя факты і агляды гістарычных падзей. А таксама пераклады замежных экспертаў з Prager University',
        link:'https://www.youtube.com/channel/UCWerimu-lIkwyUGeeB2CDpA/featured'
    },
    {
        src:'./src/images/yt-movananov.jpg',
        title:'movananova belarusvideo',
        description:'Відэа ад моўных курсаў «Мова Нанова»',
        link:'https://www.youtube.com/channel/UCSVx7NyLPrRWHLjzjWdAd5A/featured'
    },
    {
        src:'./src/images/yt-vital.jpg',
        title:'Віталь Чырвінскі',
        description:'Развіццё ваеннай справы на беларускіх землях. Структура войска. Сродкі ўзброенай барацьбы. Фартыфікацыя. Ваенная стратэгія. Тактыка. Войны, паходы, бітвы. Палкаводцы і военачальнікі зямлі беларускай. Полацкае княства. Вялікае Княства Літоўскае.',
        link:'https://www.youtube.com/c/%D0%92%D1%96%D1%82%D0%B0%D0%BB%D1%8C%D0%A7%D1%8B%D1%80%D0%B2%D1%96%D0%BD%D1%81%D0%BA%D1%96%D0%A0%D0%90%D0%97%D0%9C%D0%9E%D0%92%D0%AB%D0%90%D0%91%D0%93%D0%86%D0%A1%D0%A2%D0%9E%D0%A0%D0%AB%D0%86%D0%91%D0%95%D0%9B%D0%90%D0%A0%D0%A3%D0%A1%D0%86/featured'
    },
    {
        src:'./src/images/yt-maj.jpg',
        title:'Маёнтак Падароск',
        description:'Старажытны шляхецкі маёнтак, які мае набыць новае жыццё як музэй беларускай шляхты і турыстычна-рэкрэацыйны цэнтр.',
        link:'https://www.youtube.com/channel/UCy_bzshvfnTZk5J-hyXRLPw/featured'
    },
    {
        src:'./src/images/yt-chadan.jpg',
        title:'ХАДАНОВІЧ ',
        description:'Вітаю вас на сваім канале! З вамі Андрэй Хадановіч ― беларускі паэт, перакладчык, літаратуразнаўца і выкладчык. Тут я распавядаю пра літаратуру, якая стала актуальнай у нашы часы, пра літаратуру, у якой мы з вамі цяпер жывём.',
        link:'https://www.youtube.com/channel/UCUJQcp9gg3sc46kBsppBl6Q'
    },
    {
        src:'./src/images/yt-hrodna.jpg',
        title:'Сусветная змова',
        description:'Месца з гісторыяй',
        link:'https://www.youtube.com/channel/UCQgR5LInXzatrSebZW5k6xw'
    }
]

const datatelegram = [
    {
        name:'ТЭЛЕГРАМ'
    },
    {
        src:'./src/images/tg-lohkaya.jfif',
        title:'Лёгкая Мова',
        description:'📚Старонка для тых, хто хоча палепшыць свой слоўнікавы запас беларускае мовы.',
        link:'https://t.me/lohkaja_mova'
    },
    {
        src:'./src/images/tg-super.jfif',
        title:'Супер Мова',
        description:'Пра годных беларусаў і годныя падзеі, які натхняюць размаўляць на нашай Супер Мове кожны дзень, усюды і з усімі! Штотыднёвая афіша беларускамоўных анлайн і афлайн мерапрыемстваў',
        link:'https://t.me/supermova'
    },
    {
        src:'./src/images/tg-volnaya.jfif',
        title:'Вольная мова',
        description: '"Вольная мова" - гэта платформа па арганізацыі онлайн сустрэч для людзей, якія хацелі б зрабіць сваю пасіўную беларускую мову актыўнай.\n',
        link:'https://t.me/volnajamova'
    },
    {
        src:'./src/images/tg-babilon.jfif',
        title:'Беларускі Бабілон',
        description:'Беларуская гісторыя ў незвычайных ракурсах.',
        link:'https://t.me/belbabylon'
    },
    {
        src: './src/images/tg-poshta.jfif',
        title: 'Палявая пошта',
        description: 'Паштоўкі ды фотаздымкі з відарысамі Беларусі.',
        link: 'https://t.me/poshtabel'
    },
    {
        src:'./src/images/tg-art.jfif',
        title:'Арт Вандроўня',
        description:'АРТ Вадроўня - клуб аматараў вандровак і беларускай культуры! Гістарычныя, музычныя, культурніцкія вандроўкі па Менску і Беларусі, а таксама канцэрты, лекцыі, онлайны',
        link:'https://t.me/ArtVandrownia'
    },
    {
        src:'./src/images/tg-bellit.jfif',
        title:'Белліт',
        description:' Чытацкі дзённік.Пра беларускую і сусветную літаратуру на беларускай мове.',
        link:'https://t.me/bellitra'
    },
    {
        src:'./src/images/tg-moda.jfif',
        title:'Мода На Мову',
        description:'Канал з беларускімі фразеалагізмамі, жартамі, цытатамі, моўнымі асаблівасцямі і шмат яўчэ чым!',
        link:'https://t.me/modaNaMovu'
    },
    {
        src:'./src/images/tg-history.jfif',
        title:'Belarus history',
        description:'Гісторыя Беларусі ў здымках і кароткіх цікавых фактах.',
        link:'https://t.me/belarusian_history'
    },
    {
        src:'./src/images/tg-zabi.jfif',
        title:'Забі зяпу',
        description:'Распаўсюд беларускай мовы праз стварэньне сучаснага кантэнту на жыцьцёвыя тэмы',
        link:'https://t.me/zabiziapu'
    }
]

const datamusic = [
    {
        name:'МУЗЫКА'
    },
    {
        src:'./src/images/music-nizkiz.jpg',
        title:'Nizkiz',
        description:'Рок-гурт з г. Магілёва. Заснаваны ў 2008 годзе. Склад: Аляксандр Іллін (вакал, тэксты), Леанід Несцярук (гітара), Сяргей Кульша (бас-гітара), Зміцер Халяўкін (барабаны).',
        link:'https://music.yandex.by/artist/3866018'
    },
    {
        src:'./src/images/music-lyavon.jpg',
        title:'Лявон Вольскі',
        description:'Лявон Вольскі — беларускі музычны і грамадскі дзеяч, вакаліст, гітарыст, кампазітар, мастак, паэт, празаік, радыёвядоўца, стваральнік культурна-адукацыйных, забаўляльных і сатырычных праектаў',
        link:'https://music.yandex.by/artist/7253871'
    },
    {
        src:'./src/images/music-razbit.jpeg',
        title:'Разбiтае сэрца пацана',
        description: 'Музычны гурт, заснаваны ў канцы 1990-х гадоў. Вылучаецца тым, што піша і выконвае свае песні на трасянцы.',
        link:'https://music.yandex.by/artist/519200'
    },
    {
        src:'./src/images/music-navi.jfif',
        title:'NaviBand',
        description:'Беларускі музычны гурт з Мінска. У склад гурту ўваходзяць: Арцём Лук\'яненка, Ксенія Жук, а таксама Аляксандр Табольскі, Уладзіслаў Чещевик, Уладзімір Бегер.',
        link:'https://music.yandex.by/artist/4793550'
    },
    {
        src: './src/images/music-val.jpg',
        title: 'VAL',
        description: 'VAL — поп-дуэт з Мінска. Творчы звяз саўндпрадусара Улада Фраймана і вакалісткі Валерыі Грыбусавай.',
        link: 'https://music.yandex.by/artist/7945556'
    },
    {
        src:'./src/images/тк.jpeg',
        title:'Тутэйшы Шляхціч',
        description:'Канал накіраваны на папулярызацыю беларускай культуры, гісторыі і мовы. На гэтым канале вы зможаце пабачыць ролікі аб гістарычных падзеях, асобах, гісторыка-культурных каштоўнасцях, цікавых месцах і аб\'ектах звязаных з Беларуссю, а таксама ўсялякія падарожжы, ды забаўкі.',
        link:'https://www.youtube.com/c/%D0%A2%D1%83%D1%82%D1%8D%D0%B9%D1%88%D1%8B%D0%A8%D0%BB%D1%8F%D1%85%D1%86%D1%96%D1%87/featured'
    },
    {
        src:'./src/images/yt-sluchaj.jpg',
        title:'Слухай Сюды',
        description:'Тут вы знойдзеце агляды актуальных падзей Беларусі і замежжа. Меркаваньні экспертаў і аналітыку па важных культурных, палітычных і эканамічных сусветных трэндах. Цікавыя факты і агляды гістарычных падзей. А таксама пераклады замежных экспертаў з Prager University',
        link:'https://www.youtube.com/channel/UCWerimu-lIkwyUGeeB2CDpA/featured'
    },
    {
        src:'./src/images/yt-movananov.jpg',
        title:'movananova belarusvideo',
        description:'Відэа ад моўных курсаў «Мова Нанова»',
        link:'https://www.youtube.com/channel/UCSVx7NyLPrRWHLjzjWdAd5A/featured'
    },
    {
        src:'./src/images/yt-vital.jpg',
        title:'Віталь Чырвінскі',
        description:'Развіццё ваеннай справы на беларускіх землях. Структура войска. Сродкі ўзброенай барацьбы. Фартыфікацыя. Ваенная стратэгія. Тактыка. Войны, паходы, бітвы. Палкаводцы і военачальнікі зямлі беларускай. Полацкае княства. Вялікае Княства Літоўскае.',
        link:'https://www.youtube.com/c/%D0%92%D1%96%D1%82%D0%B0%D0%BB%D1%8C%D0%A7%D1%8B%D1%80%D0%B2%D1%96%D0%BD%D1%81%D0%BA%D1%96%D0%A0%D0%90%D0%97%D0%9C%D0%9E%D0%92%D0%AB%D0%90%D0%91%D0%93%D0%86%D0%A1%D0%A2%D0%9E%D0%A0%D0%AB%D0%86%D0%91%D0%95%D0%9B%D0%90%D0%A0%D0%A3%D0%A1%D0%86/featured'
    },
    {
        src:'./src/images/yt-maj.jpg',
        title:'Маёнтак Падароск',
        description:'Старажытны шляхецкі маёнтак, які мае набыць новае жыццё як музэй беларускай шляхты і турыстычна-рэкрэацыйны цэнтр.',
        link:'https://www.youtube.com/channel/UCy_bzshvfnTZk5J-hyXRLPw/featured'
    },
    {
        src:'./src/images/yt-chadan.jpg',
        title:'ХАДАНОВІЧ ',
        description:'Вітаю вас на сваім канале! З вамі Андрэй Хадановіч ― беларускі паэт, перакладчык, літаратуразнаўца і выкладчык. Тут я распавядаю пра літаратуру, якая стала актуальнай у нашы часы, пра літаратуру, у якой мы з вамі цяпер жывём.',
        link:'https://www.youtube.com/channel/UCUJQcp9gg3sc46kBsppBl6Q'
    },
    {
        src:'./src/images/yt-hrodna.jpg',
        title:'Сусветная змова',
        description:'Месца з гісторыяй',
        link:'https://www.youtube.com/channel/UCQgR5LInXzatrSebZW5k6xw'
    }
]

const dataaudiobooks = [
    {
        name:'АЎДЫЁКНІГІ'
    },
    {
        src:'./src/images/yt-hodna.jpg',
        title:'Годна',
        description:'Грамадская кампанія «Годна» прысвечана стварэнню і прасоўванню сучаснай нацыянальнай ідэі Беларусі. Мы імкнемся ўмацоўваць беларускую ідэнтычнасць на глебе агульных і стваральных каштоўнасцяў.\n',
        link:'https://www.youtube.com/c/hodnaby/featured'
    },
    {
        src:'./src/images/yt-moda.jpg',
        title:'Мода на мову',
        description:'Вітаю ўсіх на канале "Мода На Мову" які быў створаны каб падняць папулярнасць беларускай мовы і пачаць выкарыстоўваць яе ў паўсядзённым жыцці.',
        link:'https://www.youtube.com/channel/UCSozv0d23TKZxN3r1yJINeQ/featured'
    },
    {
        src:'./src/images/yt-karani.jpg',
        title:'Карані і вытокі',
        description: 'Гісторыя Беларусі. Наша мова. Абрады і традыцыі.',
        link:'https://www.youtube.com/channel/UC5hc3uwPuFLy-Z4AdztnHaQ'
    },
    {
        src:'./src/images/yt-wir.jpg',
        title:'WIR BY',
        description:'Беларуская і сусветная культура і гісторыя. Распавядаем пра мастацтва, жывапіс, літаратуру, гісторыю, лінгвістыку, кіно, музыку і міфалогію па-беларуску ў лёгкай форме разам з прафесійнымі даследчыкамі і выкладчыкамі.',
        link:'https://www.youtube.com/c/WirBy/featured'
    },
    {
        src: './src/images/yt-baybus.jpg',
        title: 'BAYBUS',
        description: 'Забаўляльны, навучальны, развіццёвы канал БЭЙБУС.Лепшы сябар маленькіх гарэз і дарослых жэўжыкаў. Канал з клопатам і павагай, з хітрыкамі ды цікавосткамі, з пяшчотай і весялосцю.Будзем разам усміхацца, адкрываць новае, здзіўляцца неверагоднаму.',
        link: 'https://www.youtube.com/c/baybusby/featured'
    },
    {
        src:'./src/images/yt-tut.jpg',
        title:'Тутэйшы Шляхціч',
        description:'Канал накіраваны на папулярызацыю беларускай культуры, гісторыі і мовы. На гэтым канале вы зможаце пабачыць ролікі аб гістарычных падзеях, асобах, гісторыка-культурных каштоўнасцях, цікавых месцах і аб\'ектах звязаных з Беларуссю, а таксама ўсялякія падарожжы, ды забаўкі.',
        link:'https://www.youtube.com/c/%D0%A2%D1%83%D1%82%D1%8D%D0%B9%D1%88%D1%8B%D0%A8%D0%BB%D1%8F%D1%85%D1%86%D1%96%D1%87/featured'
    },
    {
        src:'./src/images/yt-sluchaj.jpg',
        title:'Слухай Сюды',
        description:'Тут вы знойдзеце агляды актуальных падзей Беларусі і замежжа. Меркаваньні экспертаў і аналітыку па важных культурных, палітычных і эканамічных сусветных трэндах. Цікавыя факты і агляды гістарычных падзей. А таксама пераклады замежных экспертаў з Prager University',
        link:'https://www.youtube.com/channel/UCWerimu-lIkwyUGeeB2CDpA/featured'
    },
    {
        src:'./src/images/yt-movananov.jpg',
        title:'movananova belarusvideo',
        description:'Відэа ад моўных курсаў «Мова Нанова»',
        link:'https://www.youtube.com/channel/UCSVx7NyLPrRWHLjzjWdAd5A/featured'
    },
    {
        src:'./src/images/yt-vital.jpg',
        title:'Віталь Чырвінскі',
        description:'Развіццё ваеннай справы на беларускіх землях. Структура войска. Сродкі ўзброенай барацьбы. Фартыфікацыя. Ваенная стратэгія. Тактыка. Войны, паходы, бітвы. Палкаводцы і военачальнікі зямлі беларускай. Полацкае княства. Вялікае Княства Літоўскае.',
        link:'https://www.youtube.com/c/%D0%92%D1%96%D1%82%D0%B0%D0%BB%D1%8C%D0%A7%D1%8B%D1%80%D0%B2%D1%96%D0%BD%D1%81%D0%BA%D1%96%D0%A0%D0%90%D0%97%D0%9C%D0%9E%D0%92%D0%AB%D0%90%D0%91%D0%93%D0%86%D0%A1%D0%A2%D0%9E%D0%A0%D0%AB%D0%86%D0%91%D0%95%D0%9B%D0%90%D0%A0%D0%A3%D0%A1%D0%86/featured'
    },
    {
        src:'./src/images/yt-maj.jpg',
        title:'Маёнтак Падароск',
        description:'Старажытны шляхецкі маёнтак, які мае набыць новае жыццё як музэй беларускай шляхты і турыстычна-рэкрэацыйны цэнтр.',
        link:'https://www.youtube.com/channel/UCy_bzshvfnTZk5J-hyXRLPw/featured'
    },
    {
        src:'./src/images/yt-chadan.jpg',
        title:'ХАДАНОВІЧ ',
        description:'Вітаю вас на сваім канале! З вамі Андрэй Хадановіч ― беларускі паэт, перакладчык, літаратуразнаўца і выкладчык. Тут я распавядаю пра літаратуру, якая стала актуальнай у нашы часы, пра літаратуру, у якой мы з вамі цяпер жывём.',
        link:'https://www.youtube.com/channel/UCUJQcp9gg3sc46kBsppBl6Q'
    },
    {
        src:'./src/images/yt-hrodna.jpg',
        title:'Сусветная змова',
        description:'Месца з гісторыяй',
        link:'https://www.youtube.com/channel/UCQgR5LInXzatrSebZW5k6xw'
    }
]

const datapodcasts = [
    {
        name:'ПАДКАСТЫ'
    },
    {
        src:'./src/images/yt-hodna.jpg',
        title:'Годна',
        description:'Грамадская кампанія «Годна» прысвечана стварэнню і прасоўванню сучаснай нацыянальнай ідэі Беларусі. Мы імкнемся ўмацоўваць беларускую ідэнтычнасць на глебе агульных і стваральных каштоўнасцяў.\n',
        link:'https://www.youtube.com/c/hodnaby/featured'
    },
    {
        src:'./src/images/yt-moda.jpg',
        title:'Мода на мову',
        description:'Вітаю ўсіх на канале "Мода На Мову" які быў створаны каб падняць папулярнасць беларускай мовы і пачаць выкарыстоўваць яе ў паўсядзённым жыцці.',
        link:'https://www.youtube.com/channel/UCSozv0d23TKZxN3r1yJINeQ/featured'
    },
    {
        src:'./src/images/yt-karani.jpg',
        title:'Карані і вытокі',
        description: 'Гісторыя Беларусі. Наша мова. Абрады і традыцыі.',
        link:'https://www.youtube.com/channel/UC5hc3uwPuFLy-Z4AdztnHaQ'
    },
    {
        src:'./src/images/yt-wir.jpg',
        title:'WIR BY',
        description:'Беларуская і сусветная культура і гісторыя. Распавядаем пра мастацтва, жывапіс, літаратуру, гісторыю, лінгвістыку, кіно, музыку і міфалогію па-беларуску ў лёгкай форме разам з прафесійнымі даследчыкамі і выкладчыкамі.',
        link:'https://www.youtube.com/c/WirBy/featured'
    },
    {
        src: './src/images/yt-baybus.jpg',
        title: 'BAYBUS',
        description: 'Забаўляльны, навучальны, развіццёвы канал БЭЙБУС.Лепшы сябар маленькіх гарэз і дарослых жэўжыкаў. Канал з клопатам і павагай, з хітрыкамі ды цікавосткамі, з пяшчотай і весялосцю.Будзем разам усміхацца, адкрываць новае, здзіўляцца неверагоднаму.',
        link: 'https://www.youtube.com/c/baybusby/featured'
    },
    {
        src:'./src/images/yt-tut.jpg',
        title:'Тутэйшы Шляхціч',
        description:'Канал накіраваны на папулярызацыю беларускай культуры, гісторыі і мовы. На гэтым канале вы зможаце пабачыць ролікі аб гістарычных падзеях, асобах, гісторыка-культурных каштоўнасцях, цікавых месцах і аб\'ектах звязаных з Беларуссю, а таксама ўсялякія падарожжы, ды забаўкі.',
        link:'https://www.youtube.com/c/%D0%A2%D1%83%D1%82%D1%8D%D0%B9%D1%88%D1%8B%D0%A8%D0%BB%D1%8F%D1%85%D1%86%D1%96%D1%87/featured'
    },
    {
        src:'./src/images/yt-sluchaj.jpg',
        title:'Слухай Сюды',
        description:'Тут вы знойдзеце агляды актуальных падзей Беларусі і замежжа. Меркаваньні экспертаў і аналітыку па важных культурных, палітычных і эканамічных сусветных трэндах. Цікавыя факты і агляды гістарычных падзей. А таксама пераклады замежных экспертаў з Prager University',
        link:'https://www.youtube.com/channel/UCWerimu-lIkwyUGeeB2CDpA/featured'
    },
    {
        src:'./src/images/yt-movananov.jpg',
        title:'movananova belarusvideo',
        description:'Відэа ад моўных курсаў «Мова Нанова»',
        link:'https://www.youtube.com/channel/UCSVx7NyLPrRWHLjzjWdAd5A/featured'
    },
    {
        src:'./src/images/yt-vital.jpg',
        title:'Віталь Чырвінскі',
        description:'Развіццё ваеннай справы на беларускіх землях. Структура войска. Сродкі ўзброенай барацьбы. Фартыфікацыя. Ваенная стратэгія. Тактыка. Войны, паходы, бітвы. Палкаводцы і военачальнікі зямлі беларускай. Полацкае княства. Вялікае Княства Літоўскае.',
        link:'https://www.youtube.com/c/%D0%92%D1%96%D1%82%D0%B0%D0%BB%D1%8C%D0%A7%D1%8B%D1%80%D0%B2%D1%96%D0%BD%D1%81%D0%BA%D1%96%D0%A0%D0%90%D0%97%D0%9C%D0%9E%D0%92%D0%AB%D0%90%D0%91%D0%93%D0%86%D0%A1%D0%A2%D0%9E%D0%A0%D0%AB%D0%86%D0%91%D0%95%D0%9B%D0%90%D0%A0%D0%A3%D0%A1%D0%86/featured'
    },
    {
        src:'./src/images/yt-maj.jpg',
        title:'Маёнтак Падароск',
        description:'Старажытны шляхецкі маёнтак, які мае набыць новае жыццё як музэй беларускай шляхты і турыстычна-рэкрэацыйны цэнтр.',
        link:'https://www.youtube.com/channel/UCy_bzshvfnTZk5J-hyXRLPw/featured'
    },
    {
        src:'./src/images/yt-chadan.jpg',
        title:'ХАДАНОВІЧ ',
        description:'Вітаю вас на сваім канале! З вамі Андрэй Хадановіч ― беларускі паэт, перакладчык, літаратуразнаўца і выкладчык. Тут я распавядаю пра літаратуру, якая стала актуальнай у нашы часы, пра літаратуру, у якой мы з вамі цяпер жывём.',
        link:'https://www.youtube.com/channel/UCUJQcp9gg3sc46kBsppBl6Q'
    },
    {
        src:'./src/images/yt-hrodna.jpg',
        title:'Сусветная змова',
        description:'Месца з гісторыяй',
        link:'https://www.youtube.com/channel/UCQgR5LInXzatrSebZW5k6xw'
    }
]



let map = new Map([
    [ 'anime', dataanime],
    [ 'films', datafilms],
    [ 'youtube', datayoutube],
    [ 'books', databooks],
    [ 'sites', datasites],
    [ 'telegram', datatelegram],
    [ 'music', datamusic],
    [ 'audiobooks', dataaudiobooks],
    [ 'podcasts', datapodcasts]
]);

const params = new URLSearchParams(window.location.search);
const categoryCards = map.get(params.get('name'));

let cards = document.getElementsByClassName('cards')[0];
let title = document.getElementById('title-place');

function openPage(link){
    window.open(link);
}

title.innerHTML += `<p>${categoryCards[0].name}</p>`

for(let i = 1; i < categoryCards.length; i++){
    cards.innerHTML += `
    <div class="card">
        <div class="card-front">
            <div class="content-card">
              <div class="card-title">${categoryCards[i].title}</div>
              <img src=${categoryCards[i].src} alt=${categoryCards[i].title} class="card-image">
            </div>
              <div class="buttons-card">
                <img src="./src/images/premium-icon-down-right-arrow-4939978.png" alt="arrow" class="arrow-front">
                <button class="card-button">Перайсці</button>
                <img src="./src/images/heart.png" alt="heart" class="card-heart">
              </div>
        </div>
        <div class="card-back card-before"> 
                <div class="card-back-title">Апісанне</div>
                <span class="card-description">${categoryCards[i].description}</span>   
                <img src="./src/images/premium-icon-down-right-arrow-4939978.png" alt="arrow" class="arrow-back">
        </div>    
    </div>`
}

let buttons = document.getElementsByClassName('card-button');
for(let i = 0; i < buttons.length; i++){
    buttons[i].addEventListener('click', () => openPage(categoryCards[i+1].link));
}

let cardFront = document.getElementsByClassName('card-front');
let cardBack = document.getElementsByClassName('card-back');
let themeButton = document.getElementsByClassName('arrow-front');
let themeButtonBack = document.getElementsByClassName('arrow-back');

for(let i = 0; i < themeButton.length; i++){
    themeButton[i].addEventListener('click', function (){
        cardFront[i].classList.add('card-front-return');
        cardBack[i].classList.remove('card-before');
        cardBack[i].classList.add('card-back-return');
    });
}

for(let i = 0; i < themeButtonBack.length; i++){
    themeButtonBack[i].addEventListener('click', function (){
        cardFront[i].classList.remove('card-front-return');
        cardBack[i].classList.add('card-before');
        cardBack[i].classList.remove('card-back-return');
    });
}

function search(){
    let text = document.getElementsByTagName('input')[0].value;
    let names = categoryCards.map(e=>e.title);
    names.shift();
    cards.innerHTML = '';
    console.log(text);
    console.log(names);
    let result = names.filter((i) => i.includes(text));

    for(let i = 0; i < result.length; i++){
        for(let j = 0; j < categoryCards.length; j++){
            if(categoryCards[j].title === result[i]){
                cards.innerHTML += `
    <div class="card">
        <div class="card-front">
            <div class="content-card">
              <div class="card-title">${categoryCards[j].title}</div>
              <img src=${categoryCards[j].src} alt=${categoryCards[j].title} class="card-image">
            </div>
              <div class="buttons-card">
                <img src="./src/images/premium-icon-down-right-arrow-4939978.png" alt="arrow" class="arrow-front">
                <button class="card-button">Перайсці</button>
                <img src="./src/images/heart.png" alt="heart" class="card-heart">
              </div>
        </div>
        <div class="card-back card-before"> 
                <div class="card-back-title">Апісанне</div>
                <span class="card-description">${categoryCards[j].description}</span>   
                <img src="./src/images/premium-icon-down-right-arrow-4939978.png" alt="arrow" class="arrow-back">
        </div>    
    </div>`
                for(let k = 0; k < themeButton.length; k++){
                    themeButton[k].addEventListener('click', function (){
                        cardFront[k].classList.add('card-front-return');
                        cardBack[k].classList.remove('card-before');
                        cardBack[k].classList.add('card-back-return');
                    });
                }

                for(let k = 0; k < themeButtonBack.length; k++){
                    themeButtonBack[k].addEventListener('click', function (){
                        cardFront[k].classList.remove('card-front-return');
                        cardBack[k].classList.add('card-before');
                        cardBack[k].classList.remove('card-back-return');
                    });
                }
            }
        }
        let buttons = document.getElementsByClassName('card-button');
        for(let i = 0; i < result.length; i++){
            for(let j = 0; j < categoryCards.length; j++){
                if(categoryCards[j].title === result[i]){

        buttons[i].addEventListener('click', () => openPage(categoryCards[j].link));
                }}}
    }

}
